In [1]:
import pandas as pd

In [2]:
dict1 = {
    'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana',],
    'Marks':[98,89,99,87,90,83,99],
    'Gender':['Male','Female','Female','Male','Male','Female','Female']
}
df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display top3 rows of Dataset.

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Check last 3 rows of dataset.

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find the shape of our dataframe(no.of rows and no.of columns)

In [5]:
df1.shape

(7, 3)

In [6]:
print('Number of rows are', df1.shape[0])
print('Number of columns are', df1.shape[1])

Number of rows are 7
Number of columns are 3

# 4. Get information of our dataset.

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. Check null Values in the dataframe.

In [8]:
df1.isnull().sum(axis=0)
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

# 6. Get overall Statistics about the dataframe

In [9]:
df1.describe()
#Defaultly works only on numerical columns.
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. Find unique values from the gender column

In [10]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8. Find the number of unique values from the gender column.

In [11]:
df1['Gender'].nunique()

2

# 9. Display count of unique values in gender column.

In [12]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find total number of students having marks between 90 to 100(inclusive) using between method

In [13]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [14]:
len(df1[(df1['Marks'] >= 90) & (df1['Marks'] <= 100)])

4

In [15]:
#using between method:
len(df1[df1['Marks'].between(90,100)])
# sum(df1[df1['Marks'].between(90,100)])

4

# 11. Find Average Marks

In [16]:
df1['Marks'].mean()

92.14285714285714

# 12. Apply Method

In [17]:
def marks(x):
    return x//2

In [18]:
df1['Half Marks '] = df1['Marks'].apply(marks)

In [19]:
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male           49
1   Aadhya     89  Female           44
2   Krisha     99  Female           49
3   Vedant     87    Male           43
4   Parshv     90    Male           45
5   Mittal     83  Female           41
6  Archana     99  Female           49

In [20]:
# Using apply and lamda funcion.
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [21]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map function

In [22]:
#Converting male to 0 and female to 1
df1['Male_Female'] = df1['Gender'].map({'Male':1,'Female':0})
df1

      Name  Marks  Gender  Half Marks   Male_Female
0  Priyang     98    Male           49            1
1   Aadhya     89  Female           44            0
2   Krisha     99  Female           49            0
3   Vedant     87    Male           43            1
4   Parshv     90    Male           45            1
5   Mittal     83  Female           41            0
6  Archana     99  Female           49            0

# 14. Drop the columns

In [23]:
df1.drop(columns=['Half Marks', 'Male_Female'], axis=1, inplace=True)

KeyError: "['Half Marks'] not found in axis"

# 15. Print the name of the columns

In [24]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half Marks ', 'Male_Female'], dtype='object')

# 16. Sort the dataframe as per the marks columns

In [25]:
df1.sort_values('Marks',ascending = False)

      Name  Marks  Gender  Half Marks   Male_Female
2   Krisha     99  Female           49            0
6  Archana     99  Female           49            0
0  Priyang     98    Male           49            1
4   Parshv     90    Male           45            1
1   Aadhya     89  Female           44            0
3   Vedant     87    Male           43            1
5   Mittal     83  Female           41            0

# 17. Display Name and Marks of the female students

In [26]:
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [27]:
#using isin() method:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99